atmosphere/tutorials/ce3/currentT50/0/rhoPrime
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      rhoPrime;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
65536
(
0.00247992
0.00247893
0.00247694
0.00247397
0.00247001
0.00246508
0.00245917
0.0024523
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
512
(
-0.00239718
-0.00239631
-0.00239459
-0.00239201
-0.00238857
-0.00238428
-0.00237914
-0.00237317
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
512
(
0.00248264
0.00248165
0.00247966
0.00247668
0.00247272
0.00246778
0.00246187
0.00245499
...
)
;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.00247992
0.00247547
0.00247203
0.00246959
0.00246816
0.00246774
0.00246835
0.00247
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
4.09244e-05
4.08346e-05
4.07448e-05
4.06551e-05
4.05654e-05
4.04757e-05
4.03861e-05
4.02965e-05
...
)
;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
